slides/HW6-DNS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>HW6-DNS</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="HW6-DNS"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-10-04T01:59-0700"/>
<meta name="author" content="Jim Blomo"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">HW6-DNS</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 HW6: Use DNS tools</a></li>
<li><a href="#sec-2">2 Questions</a></li>
<li><a href="#sec-3">3 HW</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> HW6: Use DNS tools &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>Use <code>host</code> and <code>traceroute</code> commands
</li>
<li>Manually do DNS lookups
</li>
<li>Understand routes
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Questions &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">

<ol>
<li>What series of IPs would a recursive DNS server use to find the address of
     <code>m.yelp.com</code>?
</li>
<li>What are the IP addresses of <code>m.yelp.com</code>?
</li>
<li>Do IP packets leave the Berkeley network when traveling to
     <code>amplab.cs.berkeley.edu</code>? Include the command and output.
</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> HW &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>Text file with answers
</li>
<li>Don't forget projects!
</li>
</ul>





<script type="text/javascript" src="production/org-html-slideshow.js"></script>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-10-04T01:59-0700</p>
<p class="author">Author: Jim Blomo</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
